Revit 2027 API
DockablePane.PaneExists Method
 Returns true if %id% refers to a dockable pane window that currently exists in the Revit user interface, whether it's hidden or shown.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool PaneExists(
	DockablePaneId id
)
Public Shared Function PaneExists (
	id As DockablePaneId
) As Boolean
public:
static bool PaneExists(
	DockablePaneId^ id
)
static member PaneExists :
        id : DockablePaneId -> bool
Parameters
id DockablePaneId
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace